tap "aws/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "weaveworks/tap"
tap "wez/wezterm"
brew "act"
brew "autoconf"
brew "automake"
brew "asdf"
brew "aws-iam-authenticator"
brew "bash-completion"
brew "bat"
brew "bison@2.7"
brew "bluetoothconnector"
brew "bzip2"
brew "libssh2"
brew "openldap"
brew "curl"
brew "deno"
brew "docui"
brew "etcd"
brew "fd"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-secrets"
brew "gnu-time"
brew "goenv", args: ["HEAD"]
brew "grep"
brew "helm"
brew "node"
brew "http-server"
brew "hugo"
brew "jmeter"
brew "jpeg"
brew "oniguruma"
brew "jq"
brew "lazygit"
brew "lf"
brew "libedit"
brew "libiconv"
brew "libpng"
brew "libxml2"
brew "libzip"
brew "luajit", args: ["HEAD"]
brew "marp-cli"
brew "mcrypt"
brew "minikube"
brew "neovim"
brew "nghttp2"
brew "nkf"
brew "nmap"
brew "pcre2"
brew "php-cs-fixer"
brew "pkg-config"
brew "python@3.10"
brew "python-yq"
brew "python@3.9"
brew "re2c"
brew "ripgrep"
brew "starship"
brew "tfenv"
brew "tflint"
brew "tidy-html5"
brew "tig"
brew "tmux"
brew "tree"
brew "urlview"
brew "watch"
brew "z"
brew "zlib"
brew "aws/tap/aws-sam-cli"
brew "hashicorp/tap/terraform-ls"
brew "weaveworks/tap/eksctl"
cask "adoptopenjdk"
cask "font-hack-nerd-font"
cask "font-ricty-diminished"
cask "wezterm"
