tap "aws/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "weaveworks/tap"
tap "wez/wezterm"
brew "act"
brew "autoconf"
brew "automake"
brew "openssl@3"
brew "asdf"
brew "aws-sam-cli"
brew "python@3.11"
brew "awscli"
brew "libssh2"
brew "oniguruma"
brew "bat"
brew "curl"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-secrets"
brew "htop"
brew "jq"
brew "lazygit"
brew "luajit"
brew "neovim"
brew "pcre2"
brew "pipx"
brew "powerlevel10k"
brew "ripgrep"
brew "tmux"
brew "watch"
brew "zoxide"
cask "adoptopenjdk"
cask "alacritty"
cask "font-hack-nerd-font"
cask "font-ricty-diminished"
cask "graphiql"
cask "ngrok"
cask "wezterm"
vscode "4ops.terraform"
vscode "adrianwilczynski.terminal-commands"
vscode "alexbabichev.formatter-pug"
vscode "amandeepmittal.pug"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "andenetalexander.vim-cheatsheet"
vscode "astro-build.astro-vscode"
vscode "asuka.insertnumbers"
vscode "asvetliakov.vscode-neovim"
vscode "ayatokura.insertdate"
vscode "batisteo.vscode-django"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "cameron.vscode-pytest"
vscode "christian-kohler.path-intellisense"
vscode "cocopon.iceberg-theme"
vscode "craigmaslowski.erb"
vscode "csholmq.excel-to-markdown-table"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-postgresql-client2"
vscode "darkriszty.markdown-table-prettify"
vscode "davraamides.todotxt-mode"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dsznajder.es7-react-js-snippets"
vscode "dunstontc.vscode-todotxt"
vscode "dzhavat.css-flexbox-cheatsheet"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-todo-plus"
vscode "felixfbecker.php-intellisense"
vscode "figma.figma-vscode-extension"
vscode "florinpatrascu.vscode-elixir-snippets"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "frhtylcn.pythonsnippets"
vscode "gera2ld.markmap-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "groksrc.ruby"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "hollowtree.vue-snippets"
vscode "hookyqr.jsdoctagcomplete"
vscode "hridoy.rails-snippets"
vscode "huntertran.auto-markdown-toc"
vscode "ionutvmi.path-autocomplete"
vscode "jakebecker.elixir-ls"
vscode "jallen7usa.vscode-cue-fmt"
vscode "janisdd.vscode-edit-csv"
vscode "jebbs.plantuml"
vscode "jlsilva.tsdoc"
vscode "jnbt.vscode-rufo"
vscode "jock.svg"
vscode "jonsmithers.open-in-vim"
vscode "josephcz.vscode-markdown-mindmap-preview"
vscode "jsynowiec.vscode-insertdatestring"
vscode "junstyle.php-cs-fixer"
vscode "k--kato.vscode-backlog-wiki-preview"
vscode "kaiwood.endwise"
vscode "karunamurti.rspec-snippets"
vscode "kevinrose.vsc-python-indent"
vscode "kimlimjustin.jsdoc-generator"
vscode "kingsimba.tsdoc-comment"
vscode "koichisasada.vscode-rdbg"
vscode "kokororin.vscode-phpfmt"
vscode "lllllllqw.jsdoc"
vscode "lourenci.go-to-spec"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "misogi.ruby-rubocop"
vscode "monokai.theme-monokai-pro-vscode"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-speech"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vscode.vscode-typescript-tslint-plugin"
vscode "ms-vsliveshare.vsliveshare"
vscode "msyrus.go-doc"
vscode "naco-siren.gradle-language"
vscode "neptunedesign.vs-sequential-number"
vscode "nickgo.cuelang"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-jest"
vscode "patricklee.vsnotes"
vscode "phoihos.csv-to-md-table"
vscode "phplasma.csv-to-table"
vscode "pjmiravalle.terraform-advanced-syntax-highlighting"
vscode "prisma.prisma"
vscode "quicktype.quicktype"
vscode "rebornix.ruby"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "richardwillis.vscode-gradle-extension-pack"
vscode "rioj7.command-variable"
vscode "ritwickdey.liveserver"
vscode "rlivings39.fzf-quick-open"
vscode "romanpeshkov.vscode-text-tables"
vscode "rvest.vs-code-prettier-eslint"
vscode "ryuta46.multi-command"
vscode "sadesyllas.vscode-workspace-switcher"
vscode "sainnhe.sonokai"
vscode "shan.code-settings-sync"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sidthesloth.html5-boilerplate"
vscode "simonsiefke.svg-preview"
vscode "snyk-security.snyk-vulnerability-scanner"
vscode "sohamkamani.code-eol"
vscode "sorbet.sorbet-vscode-extension"
vscode "starkwang.markdown"
vscode "steoates.autoimport"
vscode "stevencl.adddoccomments"
vscode "svelte.svelte-vscode"
vscode "sysoev.vscode-open-in-github"
vscode "taichi.vscode-textlint"
vscode "tatosjb.fuzzy-search"
vscode "tetradresearch.vscode-h2o"
vscode "tomoki1207.pdf"
vscode "tomrijndorp.find-it-faster"
vscode "tushortz.python-extended-snippets"
vscode "vayan.haml"
vscode "vincaslt.highlight-matching-tag"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vstirbu.vscode-mermaid-preview"
vscode "vuetifyjs.vuetify-vscode"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "wingrunr21.vscode-ruby"
vscode "wmaurer.change-case"
vscode "wscats.search"
vscode "xdebug.php-debug"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
